package com.amitumisee;



import android.app.Activity;
import android.graphics.Typeface;
import android.os.Bundle;
import android.webkit.WebView;
import android.widget.Button;
import android.widget.TextView;

public class BathDiseasActivity extends Activity{
	
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.all_disease_details);
		
  
		 Typeface tf = Typeface.createFromAsset(getAssets(),"font/Banglafont.ttf");
		 TextView tv = (TextView) findViewById(R.id.textView1);
		 tv.setTypeface(tf);
         
      
         tv.setText("বিশ্বের অনেক মানুষই বাতের ব্যথায় আক্রান্ত এবং প্রতিদিনই এই সংখ্যা বেড়ে চলেছে আশংকাজনক হারে। বিশেষ করে ধনীদের ক্ষেত্রে এ রোগ বেশি দেখা দেয়। কারণ উন্নতমানের খাওয়া বিশেষ করে মাছ মাংস ইত্যাদি যারা বেশি খান তাদের এ বাতের সমস্যায় পড়তে হয়। এছাড়া দৈনন্দিন জীবনে যারা অলস তাদের ক্ষেত্রেও এ সমস্যা সৃষ্টি হয়। আবার বাতের ব্যথা মূলত দুই ধরণের কারণে হয়ে থাকে। প্রথমত, বয়স জনিত হাড়ের দুর্বলতা থেকে এবং দ্বিতীয়ত, হাড়ের জয়েন্ট দুর্বল ও হাড়ে ক্যালসিয়ামের অভাব জনিত কারনে। প্রখমে এটি পায়ের আঙ্গুলে পরে আস্তে আস্তে হাড়সহ শরীরের বিভিন্ন জয়েন্টে এ রোগ ছড়িয়ে পড়ে। বাত আক্রান্তস্থানে প্রচুর গরম অনুভুত হয় এবং অসহনীয় ব্যাথার সৃষ্টি হয়।"+
"বাত একটি সিস্টেমিক ডিজিজ অর্থাত্ যা কিনা পুরো শরীরে প্রভাব ফেলে। অস্থিসন্ধিতে ইউরিক এসিড জমা হয়ে এ রোগের উত্পত্তি হয়। মূত্রের মাধ্যমে যে পরিমাণ স্বাভাবিক ইউরিক এসিড বেরিয়ে যায়, তার থেকে বেশি পরিমাণ ইউরিক এসিড যখন আমাদের যকৃত্ তৈরি করে তখনই তা রক্তের পরিমাণ বাড়ায়। অথবা খাবারের মাধ্যমে বেশি পরিমাণ ইউরিক এসিডের উত্স যেমন লাল মাংস, ক্রিম, রেড ওয়াইন ইত্যাদি গ্রহণ করলে এবং বৃক্ক (কিডনি) রক্ত থেকে যথেষ্ট পরিমাণে তা ফিল্টার করতে না পারলে বাতের উপসর্গগুলো দেখা দেয়।"+
"সময়ের সঙ্গে সঙ্গে ইউরিক এসিড অস্থিসন্ধিতে ক্রিস্টালরূপে জমা হতে থাকে এবং তাতে অস্থিসন্ধি ফুলে যায়, প্রদাহ এবং ব্যথা হয় এবং সেই সঙ্গে অস্থিসন্ধি ধীরে ধীরে শক্ত হয়ে যায়। বাত সাধারণত পায়ের আঙুলের অস্থিসন্ধিকে আক্রান্ত করে। "+
"রোগের প্রাদুর্ভাব"+
"বাত সাধারণত ৪০ থেকে ৫০ বছর বয়সী পুরুষদের ক্ষেত্রে বেশি হয়ে থাকে। মহিলাদের ক্ষেত্রে সাধারণত এটি রজঃনিবৃত্তির পর অর্থাত্ ৪৫ বছরের পর দেখা দেয়। শিশু এবং তরুণদের সাধারণত এ রোগে আক্রান্ত হতে দেখা যায় না।"+

"কারণ এবং ঝুঁকিগুলো"+

"অস্থিসন্ধিতে ইউরিক এসিড জমার কারণেই বাত হয়ে থাকে। শতকরা ২০ ভাগেরও বেশি রোগীর ক্ষেত্রেই দেখা যায়, বাতরোগের পারিবারিক ইতিহাস থাকে। যেসব কারণে বাতরোগের ঝুঁকি বাড়ে তার মধ্যে উল্লেখযোগ্য হলো— ডায়াবেটিস, শরীর মোটা হয়ে যাওয়া, কিডনির রোগগুলো, সিকল সেল এনিমিয়া (এক ধরনের রক্তস্বল্পতা)। নিয়মিত অ্যালকোহল পান করলে তা দেহ থেকে ইউরিক এসিড বের করে দেয়ায় বাধা দেয় এবং প্রকারান্তরে বাতের ঝুঁকি বাড়ায়।"+
"কিছু কিছু ওষুধ যেমন—অ্যাসপিরিন, বিভিন্ন ডাই-ইউরেটিকস, লিভোডোপা, সাইক্লোস্পোরিন ইত্যাদি অনেক সময় বাতের ঝুঁকি বাড়ায়। ");
       
		
	}
	

}
