package com.amitumisee;



import android.app.Activity;
import android.graphics.Typeface;
import android.os.Bundle;
import android.widget.TextView;

public class HiperT_lokkonActivity extends Activity{
	
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.all_disease_details);
		
  
		 Typeface tf = Typeface.createFromAsset(getAssets(),"font/Banglafont.ttf");
		 TextView tv = (TextView) findViewById(R.id.textView1);
		
		 tv.setTypeface(tf);
       
             
         tv.setText("হার্ট অ্যাটাক এর কারন"+

"হৃদরোগের অনেক কারন আছে। প্রাথমিক জ্ঞানের জন্য আমরা এখানে প্রধান কারনগুলো উল্লেখ করবো- "+

"তেলযুক্ত খাদ্য গ্রহন।"+

"মানসিক চাপের মধ্যে থাকা।"+

"রক্তে এল ডি এল (খারাপ) কোলেস্ট্রলের মাত্রা বেড়ে যাওয়া এবং এইচ ডি এল (ভাল) কোলেস্ট্রলের মাত্রা কমে যাওয়া।"+

"খাদ্যে এন্টি অক্সিডেন্টের অভাব।"+

"উচ্চ রক্তচাপ,ডায়াবেটিস এবং মদ খাওয়া।"+

"শারীরিক পরিশ্রমের অভাব ও ওজন বৃদ্ধি"+

"তামাক (বিড়ি,সিগারেট,গুল,জর্দা) খাওয়া।"+



"এগুলোর মধ্যে মনসিক চাপ এমন একটি ক্ষতিকর প্রক্রিয়া যা একাই হৃদরোগ সৃষ্টি করতে পারে। মানসিক চাপের ফলে অনেক সময়ইঃ রক্তের চাপ বেড়ে যায়।"+

"হৃদপিন্ডের স্পন্দন বেরে যায়।"+

"রক্তের তেল(ফ্যাট) জমা হওয়ার কাজ দ্রুততর হয়।"+

"রক্তে সুগারের মাত্রা বেড়ে যায়।"+

"করোনারী এবং অন্যান্য ধমনীগুলো অধিক ক্রিয়াশীল হয়ে ওঠে।"+

"রক্তে “ক্লট” তৈরী হওয়ার সম্ভাবনা বেড়ে যায়।"+

"ধমনীগিলোর ভিতরের দিকে(গায়ে) কোলেস্ট্রল ও ট্রাইগ্লিসারাইড জমা হতে থাকে।"+



"উপরের কারন গুলো নিয়ন্ত্রণ যোগ্য। এছাড়া কিছু অনিয়ন্ত্রন যোগ্য কারন রয়েছে এগুলো হল বয়স"+

"লিঙ্গ"+

"বংশগত"+





"কিভাবে বুঝবেন?"+

"বুকে প্রচন্ড ব্যাথা হবে। হঠাৎ অনুভব করবেন ভারি কিছু একটা যেন বসে আছে আপনার বুকের উপর । একটা ব্যাথার ব্যান্ড বুকের চারপাশে অনুভব করবেন । বুকের ব্যাথা মনে হবে যেন বুক চিপে ফেলছে । হজম হবে না পেটের উপরের অংশে জ্বালাপোড়া করবে। "+

"এছাড়াও ছোট ছোট শ্বাস প্রশ্বাস, ঘেমে যাওয়া, অজ্ঞান হয়ে যাওয়া, ঝাপসা দেখা এবং বমি এসব হতে পারে। "+



"কিভাবে বাঁচবেন ?"+

"হার্ট এটাক হবার ফলে অধিকাংশ সময় মানুষ মারা যান, কারণ তারা একা থাকেন। অন্য কারো সাহায্য ছাড়া তাদের বুকের ওপর পাম্প করে হৃদযন্ত্রে রক্ত সঞ্চালন সম্ভব হয় না, এবং ব্যথা শুরু হবার পরে অজ্ঞান হয়ে যাবার আগ পর্যন্ত সাধারণত তাদের হাতে ১০ সেকেণ্ড সময় থাকে ।এমতাবস্থায় বুকে ব্যথার শিকার ব্যক্তি নিজেকে সাহায্য করতে পারেন বারংবার জোরে জোরে উচ্চস্বরে কাশি দিয়ে। লম্বা করে শ্বাস নিন। এবার কাশুন। লম্বা সময় নিয়ে দীর্ঘ কাশি দিন। এর ফলে আপনার ফুসফুসে স্পাটাম/মিউকাস উৎপন্ন হবে। ‘শ্বাস – কাশি, শ্বাস – কাশি...’ এই প্রক্রিয়া প্রতি দুই সেকেণ্ডে একবার করে করতে থাকুন, যতক্ষণ না কেউ আপনার সাহায্যে এগিয়ে না আসে অথবা যতক্ষণ আপনার হৃদযন্ত্র একা একাই স্বাভাবিকভাবে স্পন্দিত হতে থাকে। লম্বা করে শ্বাস নেবার ফলে আপনি পর্যাপ্ত অক্সিজেন পাবেন। আর কাশির ফলে আপনার হৃদযন্ত্র সংকোচন-প্রসারণ হবে যার ফলে আপনার হৃদপিণ্ডের ভিতর দিয়ে রক্ত সঞ্চালন প্রক্রিয়া অব্যাহত থাকবে। এবং কয়েকবার কাশির ফলে উৎপন্ন সংকোচন-প্রসারণে হৃদযন্ত্রের স্বাভাবিক, স্বয়ংক্রিয় স্পন্দনে ফিরে আসার কথা। এরপরে অপর কোনো ব্যক্তির সাহায্যে আপনি হাসপাতালে পৌঁছতে পারবেন। "+



"কি করা উচিত"+

"হার্ট এটাক হয়েছে ধরতে পারলে রোগিকে তাৎখনিক এসপিরিন/ ওয়ারফেরিন জাতীয় ওষুধ খাইয়ে দেয়া ভাল। এতে রক্ত জমাট বাঁধা বন্ধ হবে।"+

"জিহবার নিচে নাইট্রোগ্লিসারিন স্প্রে দিতে হবে।"+

"রোগিকে আশ্বস্ত রাখা। ");
         
	}}