package com.amitumisee;



import android.app.Activity;
import android.graphics.Typeface;
import android.os.Bundle;
import android.widget.TextView;

public class HiperT_potikarActivity extends Activity {
	
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.all_disease_details);
		
  
		 Typeface tf = Typeface.createFromAsset(getAssets(),"font/Banglafont.ttf");
		 TextView tv = (TextView) findViewById(R.id.textView1);
		
		 tv.setTypeface(tf);
		 tv.setText("এ রোগ নিয়ন্ত্রণের জন্য দুশ্চিন্তাহীন জীবনযাপন করতে হবে। ওজন কমাতে হবে, ছোট মাছ, শাকসবজি ও ফলমূল বেশি খেতে হবে। নিয়মিত ব্যায়াম করতে হবে এবং ডায়াবেটিস থাকলে নিয়ন্ত্রণে রাখতে হবে। এ ছাড়া উচ্চ রক্তচাপকে নিয়ন্ত্রণে রাখতে নিয়মিত ওষুধপথ্য সেবন করতে হবে। কোনোক্রমেই চিকিৎসকের নির্দেশ ছাড়া ওষুধ সেবন বন্ধ করা যাবে না। অনেকেই আবার উচ্চ রক্তচাপে আক্রান্ত জানার পরও ওষুধ খেতে অনীহা প্রকাশ করেন। কেউ কেউ এমনও ভাবেন যে উচ্চ রক্তচাপ তাঁর দৈনন্দিন জীবনপ্রবাহে কোনো সমস্যা করছে না বা রোগের কোনো লক্ষণ নেই, তাই উচ্চ রক্তচাপের ওষুধ খেতে চান না। এই ধারণাও সম্পূর্ণ ভুল। এ ধরনের রোগীরাই হঠাৎ হূদেরাগে আক্রান্ত হন, এমনকি মৃত্যুও হয়ে থাকে। এ ছাড়া বাড়িতে নিয়মিত রক্তচাপ মাপতে হবে। প্রয়োজনীয় ওষুধ সেবন করতে হবে। চিকিৎসকের পরামর্শে লিপিড প্রোফাইল পরীক্ষা করে প্রয়োজনীয় ব্যবস্থা নিতে পারেন।"+ 
"মনে রাখবেন(পূর্ব প্রস্ততি)"+ 
"৪০ বছর বয়স পার হলেই প্রত্যেকেরই বছরে একবার রক্তচাপ পরীক্ষা করা উচিত। হঠাৎ করে ওষুধ বন্ধ রাখা বা অনিয়মিতভাবে ওষুধ গ্রহণ না করা। ওষুধ গ্রহণ অবস্থায়ও অন্তত প্রতি মাসে একবার রক্তচাপ পরীক্ষা করা। ফাস্টফুড ও ফ্রোজেন ফুড খাওয়ায় সতর্ক থাকা। যেহেতু এ রোগে দীর্ঘদিন ওষুধ খেতে হয়, কাজেই বছরে অন্তত একবার কিডনি ও হূৎপিণ্ড পরীক্ষা করানো উচিত। ");
	}
}