package com.amitumisee;



import android.app.Activity;
import android.graphics.Typeface;
import android.os.Bundle;
import android.webkit.WebView;
import android.widget.Button;
import android.widget.TextView;

public class KidniDiseasActivity extends Activity{
	
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.all_disease_details);
		
  
		 Typeface tf = Typeface.createFromAsset(getAssets(),"font/Banglafont.ttf");
		 TextView tv = (TextView) findViewById(R.id.textView1);
		 tv.setTypeface(tf);
         
      
         tv.setText("ঘাতকব্যাধি বা মরণব্যাধি যে নামেই অভিহিত করি না কেন ‘কিডনি রোগ’ তৃতীয় বিশ্বের উন্নয়নশীল দেশে এখন আর অপরিচিত কোনো রোগ নয়। দেশের মোট জনসংখ্যার উল্লেখযোগ্য অংশ কোনো না কোনোভাবে কিডনি রোগে ভুগছেন। আবার অনেকে হয়তো জানেনই না তিনি কিডনি রোগে আক্রান্ত। তাই এ রোগকে আনেকে নীরব ঘাতক হিসেবেও আখ্যায়িত করে থাকেন। আসুন কিডনি রোগ সম্পর্কে কিছু সাধারণ ও প্রয়োজনীয় তথ্য জেনে নেই।"+
"কাদের হয়? কেন হয়?"+
        		 
"কিডনি রোগের সুনির্দিষ্ট কোনো বয়সসীমা অথবা লিঙ্গভেদ নেই। যে কোনো বয়সের নর-নারী জীবনের যে কোনো সময়ে কিডনি রোগে আক্রান্ত হতে পারেন। কিডনি রোগের কারণ বিবিধ। তবে বাংলাদেশের প্রেক্ষাপটে নিচের কারণগুলোকে প্রধান হিসেবে চিহ্নিত করা হয়:"+

"* দীর্ঘমেয়াদি অনিয়ন্ত্রিত রক্তচাপ। "+
"* দীর্ঘমেয়াদি অনিয়ন্ত্রিত ডায়াবেটিস। "+
"* কিডনি প্রদাহ ।"+
"* ডায়রিয়ার পর অতিরিক্ত পানিশূন্যতা।"+
" * এন্টিবায়োটিক, ব্যথানাশক ওষুধ অথবা অন্য যে কোনো ওষুধের এমনকি আয়ুর্বেদিক, হোমিও, কবিরাজি ইত্যাদি ওষুধের পার্শ্ব প্রতিক্রিয়া। "+
"* অপারেশনের পর অতিরিক্ত রক্তক্ষরণের ফলে অথবা অন্য যে কোনো কারণে শরীর থেকে অতিরিক্ত রক্তক্ষরণের ফলে হঠাত্ রক্তচাপ কমে যাওয়া। "+
"* দীর্ঘমেয়াদি মূত্রনালীতে প্রদাহ। "+
"* কিডনিতে পাথর, মূত্রনালীতে পাথর, কিডনি অথবা মূত্রনালীর জন্মগত ত্রুটি কিংবা অন্য কোনো কারণে মূত্রনালী সরু হয়ে প্রস্রাবের স্বাভাবিক প্রবাহ বাধাগ্রস্ত হলে। "+
"* বংশগত কিডনি রোগ থাকলে।"+



"কিডনি রোগের প্রকারভেদ : বৃহত্তর সংজ্ঞায় কিডনি রোগকে তিন ভাগে ভাগ করা যায়—"+
"১.সাময়িক বা স্বল্পমেয়াদি কিডনি রোগ।"+
"২.দীর্ঘমেয়াদি কিডনি রোগ।"+
"৩.স্থায়ী কিডনি বিকল রোগ।"+

"এই তিন ভাগের মধ্যে সাময়িক বা স্বল্পমেয়াদি কিডনি রোগ সাধারণত দ্রুত ও যথাযথ চিকিত্সার মাধ্যমে ভালো করা সম্ভব। ফলে কিডনি সুস্থ ও স্বাভাবিক অবস্থায় ফিরে যায়। তবে অহেতুক সময়ক্ষেপণ অথবা অপচিকিত্সা স্থায়ীভাবে কিডনি বিকল করে দিতে পারে।"+
"অন্যদিকে দীর্ঘমেয়াদি কিডনি রোগে আক্রান্ত রোগীর কিডনি যথাযথ চিকিত্সা নেয়ার পরও এক সময় স্থায়ী কিডনি বিকল পর্যায়ে চলে যেতে পারে।"+
"স্থায়ী কিডনি বিকল রোগে আক্রান্ত রোগীর কিডনি স্থায়ীভাবে বিকল হয়ে যাওয়ার ফলে কখনোই আর স্বাভাবিক অবস্থায় ফিরে আসে না।।");
       
		
	}
	

}
